export const state = () => ({
  content: [
    {
      id: 1,
      paragraphs: [
        {
          id: 1,
          text: `Есть вещи, которые не лечатся. Особенности характера, страстные
      увлечения, привычки, ставшие частью нашего «я», фобии, которые мы
      приобрели в детстве. Список можно продолжать до бесконечности, но одна
      болезнь в него точно не войдет. Эта болезнь — рак. Рак лечится, и
      лучшее доказательство — люди с их неизлечимыми особенностями, которые
      сумели победить рак.`,
        },
        {
          id: 2,
          text: `Рак лечится — проект Благотворительного Фонда Константина Хабенского и
      Leo Burnett Moscow. С его помощью мы надеемся изменить отношение людей
      к раку и заставить каждого поверить: онкологическое заболевание — это
      не приговор.`,
        },
      ],
    },
    {
      id: 2,
      paragraphs: [
        {
          id: 1,
          text: `Благотворительный Фонд Константина Хабенского с 2008 года помогает
        детям с онкологическими и другими тяжелыми заболеваниями головного мозга.
        Фонд не только поддерживает семью заболевшего ребенка в самый сложный момент,
        оплачивая обследования, лечение и медицинские препараты, но и в целом меняет
        систему оказания помощи детям с опухолями мозга в России.`,
        },
      ],
    },
  ],
  toggleButtons: [
    {
      id: 1,
      title: 'Рак Лечится',
    },
    {
      id: 2,
      title: 'Фонд Хабенского',
    },
  ],
  contentToShow: {},
});

export const mutations = {
  showContentById(state, toggleButtonId) {
    return (state.contentToShow = state.content[toggleButtonId - 1]);
  },
};

export const getters = {
  getContentToShow(state) {
    if (state.contentToShow.id) {
      return state.contentToShow;
    }
    return state.content[0];
  },
  getToggleButtons(state) {
    return state.toggleButtons;
  },
};
